amczarny/DigitalBack/board/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/***********************************************************************************************************************
 * Definitions
 **********************************************************************************************************************/

/*! @brief Direction type  */
typedef enum _pin_mux_direction
{
  kPIN_MUX_DirectionInput = 0U,         /* Input direction */
  kPIN_MUX_DirectionOutput = 1U,        /* Output direction */
  kPIN_MUX_DirectionInputOrOutput = 2U  /* Input or output direction */
} pin_mux_direction_t;

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/* GPIO_AD_B0_07 (number 101), D3 */
/* Routed pin properties */
#define ARDUINO_D3_PERIPHERAL                                              GPIO1   /*!< Peripheral name */
#define ARDUINO_D3_SIGNAL                                                gpio_io   /*!< Signal name */
#define ARDUINO_D3_CHANNEL                                                    7U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define ARDUINO_D3_GPIO                                                    GPIO1   /*!< GPIO peripheral base pointer */
#define ARDUINO_D3_GPIO_PIN                                                   7U   /*!< GPIO pin number */
#define ARDUINO_D3_GPIO_PIN_MASK                                      (1U << 7U)   /*!< GPIO pin mask */
#define ARDUINO_D3_PORT                                                    GPIO1   /*!< PORT peripheral base pointer */
#define ARDUINO_D3_PIN                                                        7U   /*!< PORT pin number */
#define ARDUINO_D3_PIN_MASK                                           (1U << 7U)   /*!< PORT pin mask */

/* GPIO_AD_B0_05 (number 106), D4 */
/* Routed pin properties */
#define ARDUINO_D4_PERIPHERAL                                              GPIO1   /*!< Peripheral name */
#define ARDUINO_D4_SIGNAL                                                gpio_io   /*!< Signal name */
#define ARDUINO_D4_CHANNEL                                                    5U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define ARDUINO_D4_GPIO                                                    GPIO1   /*!< GPIO peripheral base pointer */
#define ARDUINO_D4_GPIO_PIN                                                   5U   /*!< GPIO pin number */
#define ARDUINO_D4_GPIO_PIN_MASK                                      (1U << 5U)   /*!< GPIO pin mask */
#define ARDUINO_D4_PORT                                                    GPIO1   /*!< PORT peripheral base pointer */
#define ARDUINO_D4_PIN                                                        5U   /*!< PORT pin number */
#define ARDUINO_D4_PIN_MASK                                           (1U << 5U)   /*!< PORT pin mask */

/* GPIO_AD_B0_09 (number 99), D2 */
/* Routed pin properties */
#define ARDUINO_D2_PERIPHERAL                                              GPIO1   /*!< Peripheral name */
#define ARDUINO_D2_SIGNAL                                                gpio_io   /*!< Signal name */
#define ARDUINO_D2_CHANNEL                                                    9U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define ARDUINO_D2_GPIO                                                    GPIO1   /*!< GPIO peripheral base pointer */
#define ARDUINO_D2_GPIO_PIN                                                   9U   /*!< GPIO pin number */
#define ARDUINO_D2_GPIO_PIN_MASK                                      (1U << 9U)   /*!< GPIO pin mask */
#define ARDUINO_D2_PORT                                                    GPIO1   /*!< PORT peripheral base pointer */
#define ARDUINO_D2_PIN                                                        9U   /*!< PORT pin number */
#define ARDUINO_D2_PIN_MASK                                           (1U << 9U)   /*!< PORT pin mask */

/* GPIO_AD_B0_06 (number 105), D5 */
/* Routed pin properties */
#define ARDUINO_D5_PERIPHERAL                                              GPIO1   /*!< Peripheral name */
#define ARDUINO_D5_SIGNAL                                                gpio_io   /*!< Signal name */
#define ARDUINO_D5_CHANNEL                                                    6U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define ARDUINO_D5_GPIO                                                    GPIO1   /*!< GPIO peripheral base pointer */
#define ARDUINO_D5_GPIO_PIN                                                   6U   /*!< GPIO pin number */
#define ARDUINO_D5_GPIO_PIN_MASK                                      (1U << 6U)   /*!< GPIO pin mask */
#define ARDUINO_D5_PORT                                                    GPIO1   /*!< PORT peripheral base pointer */
#define ARDUINO_D5_PIN                                                        6U   /*!< PORT pin number */
#define ARDUINO_D5_PIN_MASK                                           (1U << 6U)   /*!< PORT pin mask */

/* GPIO_AD_B0_14 (number 94), D6 */
/* Routed pin properties */
#define ARDUINO_D6_PERIPHERAL                                              GPIO1   /*!< Peripheral name */
#define ARDUINO_D6_SIGNAL                                                gpio_io   /*!< Signal name */
#define ARDUINO_D6_CHANNEL                                                   14U   /*!< Signal channel */

