amczarny/DigitalBack/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define ARDUINO_D6_GPIO                                                    GPIO1   /*!< GPIO peripheral base pointer */
#define ARDUINO_D6_GPIO_PIN                                                  14U   /*!< GPIO pin number */
#define ARDUINO_D6_GPIO_PIN_MASK                                     (1U << 14U)   /*!< GPIO pin mask */
#define ARDUINO_D6_PORT                                                    GPIO1   /*!< PORT peripheral base pointer */
#define ARDUINO_D6_PIN                                                       14U   /*!< PORT pin number */
#define ARDUINO_D6_PIN_MASK                                          (1U << 14U)   /*!< PORT pin mask */

/* GPIO_AD_B1_06 (number 84), D7 */
/* Routed pin properties */
#define ARDUINO_D7_PERIPHERAL                                              GPIO1   /*!< Peripheral name */
#define ARDUINO_D7_SIGNAL                                                gpio_io   /*!< Signal name */
#define ARDUINO_D7_CHANNEL                                                   22U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define ARDUINO_D7_GPIO                                                    GPIO1   /*!< GPIO peripheral base pointer */
#define ARDUINO_D7_GPIO_PIN                                                  22U   /*!< GPIO pin number */
#define ARDUINO_D7_GPIO_PIN_MASK                                     (1U << 22U)   /*!< GPIO pin mask */
#define ARDUINO_D7_PORT                                                    GPIO1   /*!< PORT peripheral base pointer */
#define ARDUINO_D7_PIN                                                       22U   /*!< PORT pin number */
#define ARDUINO_D7_PIN_MASK                                          (1U << 22U)   /*!< PORT pin mask */

/* GPIO_AD_B0_10 (number 98), CLK */
/* Routed pin properties */
#define ARDUINO_CLK_PERIPHERAL                                            LPSPI1   /*!< Peripheral name */
#define ARDUINO_CLK_SIGNAL                                                   SCK   /*!< Signal name */

/* GPIO_AD_B0_12 (number 96), MOSI */
/* Routed pin properties */
#define ARDUINO_MOSI_PERIPHERAL                                           LPSPI1   /*!< Peripheral name */
#define ARDUINO_MOSI_SIGNAL                                                  SDO   /*!< Signal name */

/* GPIO_AD_B0_11 (number 97), PCS0 */
/* Routed pin properties */
#define ARDUINO_PCS0_PERIPHERAL                                           LPSPI1   /*!< Peripheral name */
#define ARDUINO_PCS0_SIGNAL                                                 PCS0   /*!< Signal name */

/* GPIO_AD_B0_13 (number 95), MISO */
/* Routed pin properties */
#define ARDUINO_MISO_PERIPHERAL                                           LPSPI1   /*!< Peripheral name */
#define ARDUINO_MISO_SIGNAL                                                  SDI   /*!< Signal name */

/* GPIO_AD_B1_09 (number 81), UART_RX */
/* Routed pin properties */
#define ARDUINO_UART_RX_PERIPHERAL                                       LPUART2   /*!< Peripheral name */
#define ARDUINO_UART_RX_SIGNAL                                                RX   /*!< Signal name */

/* GPIO_AD_B1_08 (number 82), UART_TX */
/* Routed pin properties */
#define ARDUINO_UART_TX_PERIPHERAL                                       LPUART2   /*!< Peripheral name */
#define ARDUINO_UART_TX_SIGNAL                                                TX   /*!< Signal name */

/* GPIO_AD_B1_10 (number 80), A0 */
/* Routed pin properties */
#define ARDUINO_A0_PERIPHERAL                                              GPIO1   /*!< Peripheral name */
#define ARDUINO_A0_SIGNAL                                                gpio_io   /*!< Signal name */
#define ARDUINO_A0_CHANNEL                                                   26U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define ARDUINO_A0_GPIO                                                    GPIO1   /*!< GPIO peripheral base pointer */
#define ARDUINO_A0_GPIO_PIN                                                  26U   /*!< GPIO pin number */
#define ARDUINO_A0_GPIO_PIN_MASK                                     (1U << 26U)   /*!< GPIO pin mask */
#define ARDUINO_A0_PORT                                                    GPIO1   /*!< PORT peripheral base pointer */
#define ARDUINO_A0_PIN                                                       26U   /*!< PORT pin number */
#define ARDUINO_A0_PIN_MASK                                          (1U << 26U)   /*!< PORT pin mask */

/* GPIO_AD_B1_11 (number 79), A1 */
/* Routed pin properties */
#define ARDUINO_A1_PERIPHERAL                                              GPIO1   /*!< Peripheral name */
#define ARDUINO_A1_SIGNAL                                                gpio_io   /*!< Signal name */
#define ARDUINO_A1_CHANNEL                                                   27U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define ARDUINO_A1_GPIO                                                    GPIO1   /*!< GPIO peripheral base pointer */
#define ARDUINO_A1_GPIO_PIN                                                  27U   /*!< GPIO pin number */
#define ARDUINO_A1_GPIO_PIN_MASK                                     (1U << 27U)   /*!< GPIO pin mask */
#define ARDUINO_A1_PORT                                                    GPIO1   /*!< PORT peripheral base pointer */
#define ARDUINO_A1_PIN                                                       27U   /*!< PORT pin number */
#define ARDUINO_A1_PIN_MASK                                          (1U << 27U)   /*!< PORT pin mask */

/* GPIO_AD_B1_12 (number 78), A2 */
/* Routed pin properties */
#define ARDUINO_A2_PERIPHERAL                                              GPIO1   /*!< Peripheral name */
#define ARDUINO_A2_SIGNAL                                                gpio_io   /*!< Signal name */
#define ARDUINO_A2_CHANNEL                                                   28U   /*!< Signal channel */

