amczarny/DigitalBack/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define ARDUINO_A2_GPIO                                                    GPIO1   /*!< GPIO peripheral base pointer */
#define ARDUINO_A2_GPIO_PIN                                                  28U   /*!< GPIO pin number */
#define ARDUINO_A2_GPIO_PIN_MASK                                     (1U << 28U)   /*!< GPIO pin mask */
#define ARDUINO_A2_PORT                                                    GPIO1   /*!< PORT peripheral base pointer */
#define ARDUINO_A2_PIN                                                       28U   /*!< PORT pin number */
#define ARDUINO_A2_PIN_MASK                                          (1U << 28U)   /*!< PORT pin mask */

/* GPIO_AD_B1_13 (number 76), A3 */
/* Routed pin properties */
#define ARDUINO_A3_PERIPHERAL                                              GPIO1   /*!< Peripheral name */
#define ARDUINO_A3_SIGNAL                                                gpio_io   /*!< Signal name */
#define ARDUINO_A3_CHANNEL                                                   29U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define ARDUINO_A3_GPIO                                                    GPIO1   /*!< GPIO peripheral base pointer */
#define ARDUINO_A3_GPIO_PIN                                                  29U   /*!< GPIO pin number */
#define ARDUINO_A3_GPIO_PIN_MASK                                     (1U << 29U)   /*!< GPIO pin mask */
#define ARDUINO_A3_PORT                                                    GPIO1   /*!< PORT peripheral base pointer */
#define ARDUINO_A3_PIN                                                       29U   /*!< PORT pin number */
#define ARDUINO_A3_PIN_MASK                                          (1U << 29U)   /*!< PORT pin mask */

/* GPIO_AD_B1_15 (number 74), A4 */
/* Routed pin properties */
#define ARDUINO_A4_PERIPHERAL                                              GPIO1   /*!< Peripheral name */
#define ARDUINO_A4_SIGNAL                                                gpio_io   /*!< Signal name */
#define ARDUINO_A4_CHANNEL                                                   31U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define ARDUINO_A4_GPIO                                                    GPIO1   /*!< GPIO peripheral base pointer */
#define ARDUINO_A4_GPIO_PIN                                                  31U   /*!< GPIO pin number */
#define ARDUINO_A4_GPIO_PIN_MASK                                     (1U << 31U)   /*!< GPIO pin mask */
#define ARDUINO_A4_PORT                                                    GPIO1   /*!< PORT peripheral base pointer */
#define ARDUINO_A4_PIN                                                       31U   /*!< PORT pin number */
#define ARDUINO_A4_PIN_MASK                                          (1U << 31U)   /*!< PORT pin mask */

/* GPIO_AD_B1_14 (number 75), A5 */
/* Routed pin properties */
#define ARDUINO_A5_PERIPHERAL                                              GPIO1   /*!< Peripheral name */
#define ARDUINO_A5_SIGNAL                                                gpio_io   /*!< Signal name */
#define ARDUINO_A5_CHANNEL                                                   30U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define ARDUINO_A5_GPIO                                                    GPIO1   /*!< GPIO peripheral base pointer */
#define ARDUINO_A5_GPIO_PIN                                                  30U   /*!< GPIO pin number */
#define ARDUINO_A5_GPIO_PIN_MASK                                     (1U << 30U)   /*!< GPIO pin mask */
#define ARDUINO_A5_PORT                                                    GPIO1   /*!< PORT peripheral base pointer */
#define ARDUINO_A5_PIN                                                       30U   /*!< PORT pin number */
#define ARDUINO_A5_PIN_MASK                                          (1U << 30U)   /*!< PORT pin mask */

/* GPIO_AD_B1_07 (number 83), D8 */
/* Routed pin properties */
#define ARDUINO_D8_PERIPHERAL                                              GPIO1   /*!< Peripheral name */
#define ARDUINO_D8_SIGNAL                                                gpio_io   /*!< Signal name */
#define ARDUINO_D8_CHANNEL                                                   23U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define ARDUINO_D8_GPIO                                                    GPIO1   /*!< GPIO peripheral base pointer */
#define ARDUINO_D8_GPIO_PIN                                                  23U   /*!< GPIO pin number */
#define ARDUINO_D8_GPIO_PIN_MASK                                     (1U << 23U)   /*!< GPIO pin mask */
#define ARDUINO_D8_PORT                                                    GPIO1   /*!< PORT peripheral base pointer */
#define ARDUINO_D8_PIN                                                       23U   /*!< PORT pin number */
#define ARDUINO_D8_PIN_MASK                                          (1U << 23U)   /*!< PORT pin mask */

/* GPIO_AD_B0_15 (number 93), D9 */
/* Routed pin properties */
#define ARDUINO_D9_PERIPHERAL                                              GPIO1   /*!< Peripheral name */
#define ARDUINO_D9_SIGNAL                                                gpio_io   /*!< Signal name */
#define ARDUINO_D9_CHANNEL                                                   15U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define ARDUINO_D9_GPIO                                                    GPIO1   /*!< GPIO peripheral base pointer */
#define ARDUINO_D9_GPIO_PIN                                                  15U   /*!< GPIO pin number */
#define ARDUINO_D9_GPIO_PIN_MASK                                     (1U << 15U)   /*!< GPIO pin mask */
#define ARDUINO_D9_PORT                                                    GPIO1   /*!< PORT peripheral base pointer */
#define ARDUINO_D9_PIN                                                       15U   /*!< PORT pin number */
#define ARDUINO_D9_PIN_MASK                                          (1U << 15U)   /*!< PORT pin mask */

