amczarny/DigitalBack/board/pin_mux.h
/* GPIO_AD_B1_03 (number 89), D14 */
/* Routed pin properties */
#define ARDUINO_D14_PERIPHERAL                                             GPIO1   /*!< Peripheral name */
#define ARDUINO_D14_SIGNAL                                               gpio_io   /*!< Signal name */
#define ARDUINO_D14_CHANNEL                                                  19U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define ARDUINO_D14_GPIO                                                   GPIO1   /*!< GPIO peripheral base pointer */
#define ARDUINO_D14_GPIO_PIN                                                 19U   /*!< GPIO pin number */
#define ARDUINO_D14_GPIO_PIN_MASK                                    (1U << 19U)   /*!< GPIO pin mask */
#define ARDUINO_D14_PORT                                                   GPIO1   /*!< PORT peripheral base pointer */
#define ARDUINO_D14_PIN                                                      19U   /*!< PORT pin number */
#define ARDUINO_D14_PIN_MASK                                         (1U << 19U)   /*!< PORT pin mask */

/* GPIO_AD_B1_02 (number 90), D15 */
/* Routed pin properties */
#define ARDUINO_D15_PERIPHERAL                                             GPIO1   /*!< Peripheral name */
#define ARDUINO_D15_SIGNAL                                               gpio_io   /*!< Signal name */
#define ARDUINO_D15_CHANNEL                                                  18U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define ARDUINO_D15_GPIO                                                   GPIO1   /*!< GPIO peripheral base pointer */
#define ARDUINO_D15_GPIO_PIN                                                 18U   /*!< GPIO pin number */
#define ARDUINO_D15_GPIO_PIN_MASK                                    (1U << 18U)   /*!< GPIO pin mask */
#define ARDUINO_D15_PORT                                                   GPIO1   /*!< PORT peripheral base pointer */
#define ARDUINO_D15_PIN                                                      18U   /*!< PORT pin number */
#define ARDUINO_D15_PIN_MASK                                         (1U << 18U)   /*!< PORT pin mask */

/* GPIO_SD_B1_03 (number 28), D14_IO3 */
/* Routed pin properties */
#define ARDUINO_D14_IO3_PERIPHERAL                                         GPIO3   /*!< Peripheral name */
#define ARDUINO_D14_IO3_SIGNAL                                           gpio_io   /*!< Signal name */
#define ARDUINO_D14_IO3_CHANNEL                                              23U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define ARDUINO_D14_IO3_GPIO                                               GPIO3   /*!< GPIO peripheral base pointer */
#define ARDUINO_D14_IO3_GPIO_PIN                                             23U   /*!< GPIO pin number */
#define ARDUINO_D14_IO3_GPIO_PIN_MASK                                (1U << 23U)   /*!< GPIO pin mask */
#define ARDUINO_D14_IO3_PORT                                               GPIO3   /*!< PORT peripheral base pointer */
#define ARDUINO_D14_IO3_PIN                                                  23U   /*!< PORT pin number */
#define ARDUINO_D14_IO3_PIN_MASK                                     (1U << 23U)   /*!< PORT pin mask */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void ARDUINO(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
